robotology/icub-firmware/emBODY/arch-dspic33/body/abslayer/hal-package/hal/hal-src/hal_dspic_can.c
/*
 * Copyright (C) 2011 Department of Robotics Brain and Cognitive Sciences - Istituto Italiano di Tecnologia
 * Author: Valentina Gaggero, Marco Accame
 * email:   valentina.gaggero@iit.it, marco.accame@iit.it
 * website: www.robotcub.org
 * Permission is granted to copy, distribute, and/or modify this program
 * under the terms of the GNU General Public License, version 2 or any
 * later version published by the Free Software Foundation.
 *
 * A copy of the license can be found at
 * http://www.robotcub.org/icub/license/gpl.txt
 *
 * This program is distributed in the hope that it will be useful, but
 * WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the GNU General
 * Public License for more details
*/

/* @file       hal_dspic_can.c
    @brief      This file implements internal implementation of the hal can module.
    @author     valentina.gaggero@iit.it, marco.accame@iit.it
    @date       05/27/2010
**/

// - modules to be built: contains the HAL_USE_* macros ---------------------------------------------------------------
#include "hal_brdcfg_modules.h"

#ifdef HAL_USE_CAN

// --------------------------------------------------------------------------------------------------------------------
// - external dependencies
// --------------------------------------------------------------------------------------------------------------------

#include "stdlib.h"

#include "p33fxxxx.h"
#include <libpic30.h>

#include "string.h"

#include "hal_brdcfg.h"
#include "hal_dspic_base_hid.h" 
#include "hal_sys.h"
#include "hal_arch_dspic.h" 


 
// --------------------------------------------------------------------------------------------------------------------
// - declaration of extern public interface
// --------------------------------------------------------------------------------------------------------------------

#include "hal_can.h"


// --------------------------------------------------------------------------------------------------------------------
// - declaration of extern hidden interface 
// --------------------------------------------------------------------------------------------------------------------

#include "hal_dspic_can_hid.h" 

// --------------------------------------------------------------------------------------------------------------------
// - #define with internal scope
// --------------------------------------------------------------------------------------------------------------------

#define HAL_can_port2index(p)                   ((uint8_t)((p)))


// CAN Baud Rate Configuration        
#define HAL_CAN_FREQ                            40000000
#define HAL_CAN_NTQ                             20         // 20 Time Quanta in a Bit Time

#define HAL_CAN_BAUDRATE_1Mbps                  1000000 
#define HAL_CAN_BAUDRATE_500Kbps                500000  
#define HAL_CAN_BR_VAL_1Mbps                    ((HAL_CAN_FREQ/(2*HAL_CAN_NTQ*HAL_CAN_BAUDRATE_1Mbps))-1)
#define HAL_CAN_BR_VAL_500kbps                  ((HAL_CAN_FREQ/(2*HAL_CAN_NTQ*HAL_CAN_BAUDRATE_500Kbps))-1) //never tested

//#define HAL_CAN_DSPIC_DEF_QUEUE_CFG_INDEX_NULL    255

#define HAL_CAN_DMA_MSGBUF_NUM                  32 // se lo modifichi modifica anche la config della fifo dma

// --------------------------------------------------------------------------------------------------------------------
// - definition (and initialisation) of extern variables, but better using _get(), _set() 
// --------------------------------------------------------------------------------------------------------------------

const hal_can_cfg_t hal_can_cfg_default =
{
    .runmode            = hal_can_runmode_isr_1txq1rxq,
    .baudrate           = hal_can_baudrate_1mbps, 
    .priorx             = hal_int_priority06,
    .priotx             = hal_int_priority06,
    .callback_on_rx     = NULL,
    .arg_cb_rx          = NULL,
    .callback_on_tx     = NULL,
    .arg_cb_tx          = NULL
};


// --------------------------------------------------------------------------------------------------------------------
// - typedef with internal scope
// --------------------------------------------------------------------------------------------------------------------

typedef struct
{
    uint8_t rxqnorm_num;
    uint8_t txqnorm_num;
    uint8_t txqhigh_num;
} hal_can_dspic_queue_cfg_t;


typedef struct
{
    uint16_t IDE:1;
    uint16_t SRR:1;
    uint16_t SID:11;        // SID, 11 bit id max of 0x7FF
    uint16_t unused1:3;

    uint16_t EID6to17:12;   // EID bit from 6 to 17
    uint16_t unused2:4;

    uint16_t DLC:4;         // Data Length Code
    uint16_t RB0:1;         // reserved
    uint16_t unused3:3;
    uint16_t RB1:1;         // reserved
    uint16_t RTR:1;         // remote trans. req.
    uint16_t EID0to5:6;     // EID bit from 0 to 5

    uint8_t data[8];

    uint16_t unused4:8;
    uint16_t FILHIT:5;      // FILter HIT number
    uint16_t unused5:3;
} hal_can_dspic_DMAframe_t;



/** @typedef    struct hal_can_DMAqueue_info_t
    @brief        contains info about a queue, but not memory where queue's item can be saved.
                we use DMARAM already allocated.    
**/
typedef struct
{
    uint8_t capacity;
    uint8_t size;
    uint8_t index_in;       //index  where insert frame
    uint8_t index_out;      //index  where remove frame
} hal_can_DMAqueue_info_t;


typedef struct
{
    hal_can_cfg_t               cfg;
    //hal_can_DMAqueue_info_t     canframes_rx_norm; the hw save these info for us.
    hal_can_DMAqueue_info_t     canframes_tx_norm;
    hal_can_DMAqueue_info_t     canframes_tx_high;
    uint8_t                     enabled;
} hal_can_portdatastructure_t;


// --------------------------------------------------------------------------------------------------------------------
// - declaration of static functions
// --------------------------------------------------------------------------------------------------------------------

static hal_boolval_t s_hal_can_supported_is(hal_can_port_t port);
static void s_hal_can_initted_set(hal_can_port_t port);
static hal_boolval_t s_hal_can_initted_is(hal_can_port_t port);

// init and start CAN
static void s_hal_can_clk_init(hal_can_port_t port, hal_can_baudrate_t br_val);
static void s_hal_can_dmaqueue_info_init(hal_can_port_t port);
static void s_hal_can_dma_init(hal_can_port_t port);

// trasmission
static hal_result_t s_hal_can_isr_sendframes_canx(hal_can_port_t port);
static void s_hal_can_ena_dmabuff_withPrio(hal_can_port_t port, uint8_t buf_index);
static void s_hal_can_copy_frame_inDMA(hal_can_frame_t *frame, uint8_t dmaBuff_index);
static void s_hal_can_ena_dmabuff(uint8_t buffer_num);


// reception
static hal_result_t s_hal_can_copy_frame_fromDMA(hal_can_frame_t *frame, uint8_t dmaBuff_index);
static hal_result_t s_hal_can_rxFilter_set_mask(uint8_t mask_num, uint32_t mask_val, hal_can_frameID_format_t idformat);
static hal_result_t s_hal_can_rxFilter_set_id( uint8_t id_num, int32_t id_val, hal_can_frameID_format_t idformat, uint8_t mask_sel);



