robotology/icub-firmware/emBODY/arch-dspic33/body/abslayer/hal-package/hal/hal-src/hal_dspic_can.c
static hal_result_t s_hal_can_tx_withoutisr(hal_can_port_t port, hal_can_frame_t *frame);
static hal_result_t s_hal_can_tx_normprio(hal_can_port_t port, hal_can_frame_t *frame, hal_can_send_mode_t sm);
static hal_result_t s_hal_can_tx_highprio(hal_can_port_t port, hal_can_frame_t *frame);


static void s_hal_canperipheral_isr_tx_enable(hal_can_port_t port);
static void s_hal_canperipheral_isr_tx_disable(hal_can_port_t port);
static void s_hal_can_dma_rx_enable(hal_can_port_t port);
static void s_hal_can_dma_rx_disable(hal_can_port_t port);

static uint8_t s_hal_can_dma_rx_size(hal_can_port_t port);


// --------------------------------------------------------------------------------------------------------------------
// - definition (and initialisation) of static variables
// --------------------------------------------------------------------------------------------------------------------

/* The following values are required to work properly on dspic*/
static const hal_can_dspic_queue_cfg_t s_dspic_default_queue_cfg [hal_can_runmode_num] = 
{
    //hal_can_runmode_noisr_0q
    {
        .rxqnorm_num = 31,
        .txqnorm_num = 1,
        .txqhigh_num = 0,
    },

    //hal_can_runmode_isr_1txq1rxq
    {
        .rxqnorm_num = 28,
        .txqnorm_num = 4,
        .txqhigh_num = 0,
    },

    //hal_can_runmode_isr_2txq1rxq
    {
        .rxqnorm_num = 25,
        .txqnorm_num = 4,
        .txqhigh_num = 3,
    }
};

//this variable contains the default configuration to use, after user configuration has been checked.
//it is checked in hal_can_hid_getsize(..) 
//static uint8_t s_default_queue_cfg_index = HAL_CAN_DSPIC_DEF_QUEUE_CFG_INDEX_NULL;

static hal_can_portdatastructure_t *s_hal_can_portdatastruct_ptr[hal_can_ports_num] = {NULL, NULL}; //s_hal_can_portdatastruct_ptr

static hal_boolval_t s_hal_can_initted[hal_can_ports_num] = { hal_false, hal_false };

/* alloc buffer rx and tx in DMA */
static hal_can_dspic_DMAframe_t s_hal_can_dmabuffer[HAL_CAN_DMA_MSGBUF_NUM]__attribute__((space(dma),aligned(HAL_CAN_DMA_MSGBUF_NUM * (sizeof(hal_can_dspic_DMAframe_t)))));

static const uint8_t s_can_dmabuff_prio_tbl[] = {0, 1, 2, 3};

static uint32_t s_can_rxdmamask =  0;




// --------------------------------------------------------------------------------------------------------------------
// - definition of extern public functions
// --------------------------------------------------------------------------------------------------------------------

extern hal_result_t hal_can_init(hal_can_port_t port, const hal_can_cfg_t *cfg)
{
    hal_can_portdatastructure_t *cport = s_hal_can_portdatastruct_ptr[HAL_can_port2index(port)];

    if(hal_false == s_hal_can_supported_is(port))
    {
        return(hal_res_NOK_generic);
    }

    if(NULL == cport)
    {
        //If i'm here means memory has not been allocated because hal config has wrong params.
        //remember: queue size can not be modify. see file....
        return(hal_res_NOK_generic);
    }

    if(NULL == cfg)
    {
        cfg  = &hal_can_cfg_default;
    }
    
    // set config
    memcpy(&cport->cfg, cfg, sizeof(hal_can_cfg_t));

    s_hal_can_dmaqueue_info_init(port);
   
    // init low level
    hal_brdcfg_can__phydevices_enable(port); /* Enable physical can device */

    /* put can module in configuration mode */
    C1CTRL1bits.REQOP = 4;
    while(C1CTRL1bits.OPMODE != 4);

    s_hal_can_clk_init(port, cport->cfg.baudrate);
    s_hal_can_dma_init(port);
    
    switch(cport->cfg.runmode)
    {
        case hal_can_runmode_noisr_0q:
        {
            s_can_rxdmamask = 0xFFFFFFFE;
        } break;
        
        case hal_can_runmode_isr_1txq1rxq:
        {
            s_can_rxdmamask = 0xFFFFFFF0;
        } break;
        
        case hal_can_runmode_isr_2txq1rxq:
        {
            s_can_rxdmamask = 0xFFFFFF80;
        } break;
        
        default:
        {
        
        } break;
    }

    if(hal_can_runmode_noisr_0q != cport->cfg.runmode)
    {
         /* set can interrupt priority for tx*/
        //IPC8bits.C1IP = cport->cfg.priotx;
        hal_sys_irqn_priority_set(hal_arch_dspic_CAN1_IRQn, cport->cfg.priotx);

        /* set dma interrupt for rx. don't consider rx can interrupt, but only dma rx interrupt*/
        //IPC1bits.DMA0IP = cport->cfg.priorx; // acemor: for rx we use dam1. thus DMA0IP is wrong.
        hal_sys_irqn_priority_set(hal_arch_dspic_DMA1_IRQn, cport->cfg.priorx); 
    }
    
    /* put can module in normal mode */
    C1CTRL1bits.REQOP = 0;
    while(C1CTRL1bits.OPMODE != 0);
    

    cport->enabled = 0;  
    
    
    s_hal_can_initted_set(port);

    //Add filter to receive each message. if no filter are set, no message are recieved.
    hal_can_receptionfilter_set(hal_can_port1, 0, 0x000, 0, 0x000, hal_can_frameID_std); 

    return(hal_res_OK);
}


extern hal_result_t hal_can_enable(hal_can_port_t port)
{
    hal_can_portdatastructure_t *cport = s_hal_can_portdatastruct_ptr[HAL_can_port2index(port)];

    if(hal_false == s_hal_can_initted_is(port))
    {
        return(hal_res_NOK_generic);
    }
    
    // disable scheduling
    hal_base_hid_osal_scheduling_suspend();
    
    cport->enabled = 1;
    
    C1CTRL1bits.WIN = 0;

    DMA0CONbits.CHEN=1; //enable DMA buffer tx;
    s_hal_can_dma_rx_enable(port);

    //IEC2bits.C1IE = 0;  //disable interrupt tx
    //IEC0bits.DMA1IE = 0; //disable interrupt rx
    hal_sys_irqn_disable(hal_arch_dspic_CAN1_IRQn);
    hal_sys_irqn_disable(hal_arch_dspic_DMA1_IRQn);

    if(hal_can_runmode_noisr_0q != cport->cfg.runmode)
    {
        /* Enable DMA interrupt for RX instead of can-RX interrupt.
           So we know when datas are ready in buffer and the application can read them. 
        */
        //IEC0bits.DMA1IE = 1;
        //enable interrupt TX 
        //(it is necessary enable INT both in Interrupt Enable Register (general for all peritherals) and in CAN register)
        //C1INTEbits.TBIE = 1; 
        //IEC2bits.C1IE = 1;
        hal_sys_irqn_enable(hal_arch_dspic_CAN1_IRQn);
        hal_sys_irqn_enable(hal_arch_dspic_DMA1_IRQn);
        s_hal_canperipheral_isr_tx_enable(port); // enable the tx interrupt in can

