robotology/icub-firmware/emBODY/arch-dspic33/body/abslayer/hal-package/hal/hal-src/hal_dspic_can.c
        C1INTFbits.RBIF=0; // clear isr flag
        C1INTFbits.TBIF=0; // clear isr flag
    }
    
    // enable scheduling 
    hal_base_hid_osal_scheduling_restart();    
    
    return(hal_res_OK);
}


extern hal_result_t hal_can_disable(hal_can_port_t port) 
{
    hal_can_portdatastructure_t *cport = s_hal_can_portdatastruct_ptr[HAL_can_port2index(port)];
    
    if(hal_false == s_hal_can_initted_is(port))
    {
        return(hal_res_NOK_generic);
    }
    
    
    // disable scheduling
    hal_base_hid_osal_scheduling_suspend();

    cport->enabled = 0;

    C1CTRL1bits.WIN = 0;

    DMA0CONbits.CHEN=0; //disable DMA buffer tx;
    s_hal_can_dma_rx_disable(port);

    //IEC2bits.C1IE = 0;  //disable interrupt tx
    //IEC0bits.DMA1IE = 0; //disable interrupt rx
    // C1INTEbits.TBIE = 0;
    
    hal_sys_irqn_disable(hal_arch_dspic_CAN1_IRQn);
    hal_sys_irqn_disable(hal_arch_dspic_DMA1_IRQn);
    s_hal_canperipheral_isr_tx_disable(port); // disable the tx interrupt in can1

    // enable scheduling 
    hal_base_hid_osal_scheduling_restart();  
    
    return(hal_res_OK);
}


extern hal_result_t hal_can_put(hal_can_port_t port, hal_can_frame_t *frame, hal_can_send_mode_t sm) 
{
    hal_can_portdatastructure_t *cport = s_hal_can_portdatastruct_ptr[HAL_can_port2index(port)];
    
    hal_result_t res = hal_res_NOK_generic;

    if(hal_false == s_hal_can_initted_is(port))
    {
        return(hal_res_NOK_generic);
    }

    if(NULL == frame)
    {
        return(hal_res_NOK_nullpointer);
    }

    if( (hal_can_frame_remote == frame->frame_type) || (hal_can_frameID_ext == frame->id_type) )
    {
        return(hal_res_NOK_unsupported); // currently we don't manage hal_can_frame_remote and frame with extID
    }
    
    if(0 == cport->enabled)
    {
        return(hal_res_NOK_generic);
    }


    switch(cport->cfg.runmode)
    {
        case hal_can_runmode_noisr_0q:
        {   // used in bootloader for instance
        
            if(hal_can_send_normprio_now == sm)
            {
                res = s_hal_can_tx_withoutisr(port, frame); 
            }
            else
            {
                res = hal_res_NOK_unsupported;
            }
        
        } break;
        
        case hal_can_runmode_isr_1txq1rxq:
        case hal_can_runmode_isr_2txq1rxq:
        {
            if((hal_can_send_highprio_now == sm) && (hal_can_runmode_isr_1txq1rxq == cport->cfg.runmode))
            {   // cannot put inside a highprio queue if we only have the normprio queue
                res = hal_res_NOK_generic;
            }
            else if(hal_can_send_highprio_now == sm)
            {   // i am in highprio with the highprio queue (the second one) available
                res =  s_hal_can_tx_highprio(port, frame); 
            }
            else
            {   // can be hal_can_send_normprio_now or hal_can_send_normprio_later
                // in either 2q or 1q mode. but in any case i use the normal queue
                res = s_hal_can_tx_normprio(port, frame, sm);
            }
        
        } break;
   
        default:
        {
            res = hal_res_NOK_unsupported;
        } break;        
    
    }

    return(res);
}



extern hal_result_t hal_can_transmit(hal_can_port_t port)
{
    hal_can_portdatastructure_t *cport = s_hal_can_portdatastruct_ptr[HAL_can_port2index(port)];

    if(hal_false == s_hal_can_initted_is(port))
    {
        return(hal_res_NOK_generic);
    }
    
    if(0 == cport->enabled)
    {
        return(hal_res_NOK_generic);
    }
    
    // disable scheduling
    hal_base_hid_osal_scheduling_suspend();
    
    // trigger the tx. the trigger will empty the canframes_tx_norm.
    s_hal_can_isr_sendframes_canx(port);
    
    // enable scheduling 
    hal_base_hid_osal_scheduling_restart();
    
    return(hal_res_OK);
}

extern hal_result_t hal_can_received(hal_can_port_t port, uint8_t *numberof) 
{
    hal_can_portdatastructure_t *cport = s_hal_can_portdatastruct_ptr[HAL_can_port2index(port)];
    hal_result_t res = hal_res_NOK_generic;
    volatile uint8_t fifonextread;
    volatile uint8_t fifocurrent;

    if(hal_false == s_hal_can_initted_is(port))
    {
        return(hal_res_NOK_generic);
    }

    if( (NULL == cport) || (NULL == numberof) )
    {
        return(hal_res_NOK_generic);
    }

    if(0 == cport->enabled)
    {
        return(hal_res_NOK_generic);
    }
    
    // disable scheduling 
    hal_base_hid_osal_scheduling_suspend();
    
    //s_hal_can_dma_rx_disable(port);
    
    fifonextread = C1FIFObits.FNRB;
    fifocurrent  = C1FIFObits.FBP;
    //*numberof = (fifocurrent>fifonextread) ? (fifocurrent-fifonextread) : (fifonextread-fifocurrent);
    *numberof = s_hal_can_dma_rx_size(port);
 
    //s_hal_can_dma_rx_enable(port);
    
    // enable scheduling 
    hal_base_hid_osal_scheduling_restart();

    return(res);
}


extern hal_result_t hal_can_get(hal_can_port_t port, hal_can_frame_t *frame, uint8_t *remaining) 
{
    hal_can_portdatastructure_t *cport = s_hal_can_portdatastruct_ptr[HAL_can_port2index(port)];
    hal_result_t res = hal_res_NOK_generic;
    volatile uint8_t fifocurrent;
    volatile uint8_t fifonextread;
    volatile uint8_t size = 0;

    if(hal_false == s_hal_can_initted_is(port))
    {
        return(hal_res_NOK_generic);
    }

    if(NULL == frame)
    {
        return(hal_res_NOK_nullpointer);
    }
    
    if(0 == cport->enabled)
    {
        return(hal_res_NOK_generic);
    } 
   
    // disable scheduling 
    hal_base_hid_osal_scheduling_suspend();
    
    // no need to disable the dma in rx ... i just read the index of first fifo buffer (the FIFO Next Read Buffer Pointer)
    //s_hal_can_dma_rx_disable(port);
    
    // get buffer index of head of rx queue. hw updates it for us.
    fifonextread = C1FIFObits.FNRB;
    fifocurrent  = C1FIFObits.FBP;
    if(NULL != remaining)
    {
        size = s_hal_can_dma_rx_size(port);

        if(0 != size)
        {
            size = size;
        }
    }
    

 
    // check the buffer size. if empty returns hal_res_NOK_nodata
    if( ( (fifonextread < 16) && ((!(C1RXFUL1 & (1<<fifonextread)))) ) || ( (fifonextread >= 16) && ( (!(C1RXFUL2 & (1<<(fifonextread-16))))) ) )
    {
        if(NULL != remaining)
        {
            *remaining = 0;
        }
        //s_hal_can_dma_rx_enable(port);
        hal_base_hid_osal_scheduling_restart();
        return(hal_res_NOK_nodata);
    }

