robotology/icub-firmware/emBODY/arch-dspic33/body/abslayer/hal-package/hal/hal-src/hal_dspic_can.c
    res = s_hal_can_copy_frame_fromDMA(frame, fifonextread);
    
    if(hal_res_OK != res)
    {
        if(NULL != remaining)
        {
            *remaining = size-1;
        }
        //s_hal_can_dma_rx_enable(port);
        hal_base_hid_osal_scheduling_restart();
        return(res);
    }

    // clear bit that means buffer full
    if(fifonextread < 16)
    {
        C1RXFUL1 = ~(1<<fifonextread);
    }
    else
    {
        C1RXFUL2 = ~(1<<(fifonextread-16));
    }
  
    if(NULL != remaining)
    {
        *remaining = size-1;
    }

    //s_hal_can_dma_rx_enable(port);
    // enable scheduling 
    hal_base_hid_osal_scheduling_restart();
    
    return(hal_res_OK); 
}


extern hal_result_t hal_can_receptionfilter_set(hal_can_port_t port, uint8_t mask_num, uint32_t mask_val, uint8_t identifier_num,
                                                uint32_t identifier_val, hal_can_frameID_format_t idformat)
{
    if(hal_false == s_hal_can_initted_is(port))
    {
        return(hal_res_NOK_generic);
    }

    if(hal_can_frameID_ext == idformat)
    {
        return(hal_res_NOK_unsupported);
    }


    //check input
    if( (mask_num >= hal_brdcfg_can__rxfilter_masknum_supported) || (identifier_num >= hal_brdcfg_can__rxfilter_idnum_supported))
    {
        return(hal_res_NOK_unsupported);
    }

    s_hal_can_rxFilter_set_mask(mask_num, mask_val, idformat);

    s_hal_can_rxFilter_set_id(identifier_num, identifier_val, idformat, mask_num);


    //hal_base_hid_on_fatalerror(hal_fatalerror_unsupportedbehaviour, "hal_can_receptionfilter_set(): not supported");
    return(hal_res_OK);
}




// --------------------------------------------------------------------------------------------------------------------
// - definition of extern hidden functions 
// --------------------------------------------------------------------------------------------------------------------


// ---- isr of the module: begin ----

void __attribute__((interrupt, no_auto_psv)) _C1Interrupt(void)
{
    hal_can_portdatastructure_t *cport = s_hal_can_portdatastruct_ptr[HAL_can_port2index(hal_can_port1)]; 
    uint8_t dmabuf_num;

    if(C1INTFbits.TBIF) // if a msg was sent
    {
        dmabuf_num = C1VECbits.ICODE;

        switch(cport->cfg.runmode)
        {
            case hal_can_runmode_isr_1txq1rxq:
            {   
                if(dmabuf_num >= cport->canframes_tx_norm.capacity)
                {
                    break; //error
                }            
                cport->canframes_tx_norm.size--;
                cport->canframes_tx_norm.index_out = (cport->canframes_tx_norm.index_out + 1)% cport->canframes_tx_norm.capacity;
                if(cport->canframes_tx_norm.size > 0)
                {
                    s_hal_can_isr_sendframes_canx(hal_can_port1);
                }
            
            } break;
        
            case hal_can_runmode_isr_2txq1rxq:
            {
                if(dmabuf_num < (cport->canframes_tx_high.capacity))
                {
                    cport->canframes_tx_high.size--;
                }
                else if(dmabuf_num < (cport->canframes_tx_norm.capacity + cport->canframes_tx_high.capacity ))
                {
                    cport->canframes_tx_norm.size--;
                    cport->canframes_tx_norm.index_out = (cport->canframes_tx_norm.index_out + 1)% cport->canframes_tx_norm.capacity;
                    if(cport->canframes_tx_norm.size > 0)
                    {
                        s_hal_can_isr_sendframes_canx(hal_can_port1);
                    }
                }
                else
                {
                    break; //error
                }
            } break;
            
            default:
            {
                break; //error
            }
        }
        //clear bit
        C1INTFbits.TBIF = 0;
        IFS2bits.C1IF = 0; 
    }
}

void __attribute__((interrupt, no_auto_psv)) _DMA1Interrupt(void)

{
    hal_can_portdatastructure_t *cport = s_hal_can_portdatastruct_ptr[HAL_can_port2index(hal_can_port1)]; 

    
    if(NULL != cport->cfg.callback_on_rx)
    {
       cport->cfg.callback_on_rx(cport->cfg.arg_cb_rx); 
    }  
 
    // Clear the DMA1 Interrupt Flag;
    IFS0bits.DMA1IF = 0;    
}

// ---- isr of the module: end ------

 
extern uint32_t hal_can_hid_getsize(const hal_cfg_t *cfg)
{
    uint32_t size = 0;

    if(0 == cfg->can1_enable)
    {
        return(size);
    }    
    
    size += sizeof(hal_can_portdatastructure_t); 
    return(size);
}


extern hal_result_t hal_can_hid_setmem(const hal_cfg_t *cfg, uint32_t *memory)
{
    uint8_t *ram08 = (uint8_t*)memory;

    
    if(0 == cfg->can1_enable)
    {
        return(hal_res_OK);
    }    

    if(NULL == memory)
    {
        hal_base_hid_on_fatalerror(hal_fatalerror_missingmemory, "hal_can_hid_setmem(): memory missing");
        return(hal_res_NOK_generic);
    }

    s_hal_can_portdatastruct_ptr[HAL_can_port2index(hal_can_port1)] = (hal_can_portdatastructure_t*)ram08;
    ram08 += sizeof(hal_can_portdatastructure_t);

 
    return(hal_res_OK);
}




// --------------------------------------------------------------------------------------------------------------------
// - definition of static functions 
// --------------------------------------------------------------------------------------------------------------------

static hal_boolval_t s_hal_can_supported_is(hal_can_port_t port)
{
    return(hal_base_hid_byte_bitcheck(hal_brdcfg_can__supported_mask, HAL_can_port2index(port)) );
}

static void s_hal_can_initted_set(hal_can_port_t port)
{
    s_hal_can_initted[HAL_can_port2index(port)] = hal_true;
}

static hal_boolval_t s_hal_can_initted_is(hal_can_port_t port)
{
    return(s_hal_can_initted[HAL_can_port2index(port)]);
}




static hal_result_t s_hal_can_isr_sendframes_canx(hal_can_port_t port)
{
    hal_can_portdatastructure_t *cport = s_hal_can_portdatastruct_ptr[HAL_can_port2index(port)];
    
    s_hal_canperipheral_isr_tx_disable(port); 

    if(0 == cport->canframes_tx_norm.size) //empty queue ==> ok
    {
        s_hal_canperipheral_isr_tx_enable(port);
        return(hal_res_OK);
    }

//    if(cport->canframes_tx_norm.index < cport->canframes_tx_norm.size)
//    {
//        first = cport->canframes_tx_norm.capacity - cport->canframes_tx_norm.size + cport->canframes_tx_norm.index;
//    }
//    else
//    {
//        first = cport->canframes_tx_norm.index - cport->canframes_tx_norm.size;
//    }
   
