robotology/icub-firmware/emBODY/arch-dspic33/body/abslayer/hal-package/hal/hal-src/hal_dspic_can.c
    s_hal_can_ena_dmabuff(cport->canframes_tx_high.capacity + cport->canframes_tx_norm.index_out); 
    //cport->canframes_tx_norm.size --;

    s_hal_canperipheral_isr_tx_enable(port);
    return(hal_res_OK);
 
}


static void s_hal_can_ena_dmabuff(uint8_t buffer_num)
{
    switch(buffer_num)
    {
        case 0:
        {        
            C1TR01CONbits.TXREQ0=1;
        }break;
        
        case 1:
        {
            C1TR01CONbits.TXREQ1=1;
        }break;
        
        case 2:
        {
            C1TR23CONbits.TXREQ2=1;
        }break;
        
        case 3:
        {
            C1TR23CONbits.TXREQ3=1;
        }break;
        
        case 4:
        {
            C1TR45CONbits.TXREQ4=1;
        }break;
        
        case 5:
        {
            C1TR45CONbits.TXREQ5=1;
        }break;
        
        case 6:
        {
            C1TR67CONbits.TXREQ6=1;
        }break;

        default:
        {
            return;
        }
    }
    return;
}




static hal_result_t s_hal_can_copy_frame_fromDMA(hal_can_frame_t *frame, uint8_t dmaBuff_index)
{
    hal_can_dspic_DMAframe_t *DMAframe;
    DMAframe = &s_hal_can_dmabuffer[dmaBuff_index];
    
    //NOTE: DMAframe.IDE = 0 indicates frame with standard ID
    if( (1 == DMAframe->IDE)||(1 == DMAframe->SRR) ) //extended id or remote request trasmission
    {
        return(hal_res_NOK_unsupported);
    }


    //NOTE: sometimes is possible to receive a frame with DLC field containing a value bigger then 8.
    //This depend on hardware!!
    if(DMAframe->DLC > 8)
    {
        return(hal_res_NOK_hwerror); 
    }
    
    memset(frame, 0, sizeof(hal_can_frame_t));
    

    //currently we use only this type of frame
    frame->frame_type = hal_can_frame_data;
    frame->id_type = hal_can_frameID_std;

    // copy data from received frame
    frame->id = DMAframe->SID;

    frame->size = DMAframe->DLC;

    memcpy(&frame->data, &DMAframe->data, frame->size);

    return(hal_res_OK);
}









static hal_result_t s_hal_can_tx_withoutisr(hal_can_port_t port, hal_can_frame_t *frame)
{
    //verify if the only buffer is empty and so copy frame into it.
    if(C1TR01CONbits.TXREQ0)
    {
        return(hal_res_NOK_busy);
    }
    s_hal_can_copy_frame_inDMA(frame, 0);
    
    C1TR01CONbits.TXREQ0=1; //trasmission request
    
    return(hal_res_OK);
}



static hal_result_t s_hal_can_tx_normprio(hal_can_port_t port, hal_can_frame_t *frame, hal_can_send_mode_t sm)
{
    hal_can_portdatastructure_t *cport = s_hal_can_portdatastruct_ptr[HAL_can_port2index(port)];
    hal_result_t res = hal_res_NOK_generic;
    uint8_t buff_num;
    
   
    // disable scheduling. 
    hal_base_hid_osal_scheduling_suspend();
    
    // disable interrupt in can 1 or 2 for tx depending on value of port
    s_hal_canperipheral_isr_tx_disable(port);

//    if(hal_can_runmode_isr_1txq1rxq == cport->cfg.runmode)
//    {
//        res = s_hal_can_tx_circular_dmabuff(port, &cport->canframes_tx_high, &buff_num);
//    }
    if(cport->canframes_tx_norm.size == cport->canframes_tx_norm.capacity) //queue is full
    {
        s_hal_canperipheral_isr_tx_enable(port);
        res = hal_res_NOK_busy;
    }
    else
    {
        buff_num = cport->canframes_tx_norm.index_in + cport->canframes_tx_high.capacity;
        
        s_hal_can_copy_frame_inDMA(frame,buff_num);
        
        cport->canframes_tx_norm.index_in = (cport->canframes_tx_norm.index_in + 1)%cport->canframes_tx_norm.capacity;
        
        cport->canframes_tx_norm.size++;
        
        res = hal_res_OK;
    }
    
    s_hal_canperipheral_isr_tx_enable(port);

    if(hal_can_send_normprio_now == sm)
    {   // if send-now i empty the queue
        s_hal_can_isr_sendframes_canx(port); //hal_can_transmit();
    }
    
    // enable scheduling. 
    hal_base_hid_osal_scheduling_restart();

    

    return(res);

}




static hal_result_t s_hal_can_tx_highprio(hal_can_port_t port, hal_can_frame_t *frame)
{
    hal_can_portdatastructure_t *cport = s_hal_can_portdatastruct_ptr[HAL_can_port2index(port)];
    uint8_t buff_num;
    hal_result_t res=hal_res_OK;

    // disable scheduling
    hal_base_hid_osal_scheduling_suspend();
    
    //disable interrupt tx
    s_hal_canperipheral_isr_tx_disable(port);
    
//    res = s_hal_can_tx_circular_dmabuff(port, &cport->canframes_tx_high, &buff_num);
//
//    s_hal_can_ena_dmabuff_withPrio(port, buff_num);
//
    if(cport->canframes_tx_high.size == cport->canframes_tx_high.capacity) //queue is full
    {
        s_hal_canperipheral_isr_tx_enable(port);
        return(hal_res_NOK_busy); 
    }
    
    buff_num = cport->canframes_tx_high.capacity - 1 - cport->canframes_tx_high.index_in;
    //buff_num = cport->canframes_tx_high.index_in;
    s_hal_can_copy_frame_inDMA(frame, buff_num);
    
    s_hal_can_ena_dmabuff_withPrio(port, buff_num);
    
    cport->canframes_tx_high.size ++;
    cport->canframes_tx_high.index_in = ((cport->canframes_tx_high.index_in + 1)%cport->canframes_tx_high.capacity);

    s_hal_canperipheral_isr_tx_enable(port);

    // enable scheduling. 
    hal_base_hid_osal_scheduling_restart();

    return(res);
}

//static hal_result_t s_hal_can_tx_circular_dmabuff(hal_can_port_t port, hal_can_DMAqueue_info_t *dma_queue_ptr)
//{
//    if(dma_queue_ptr->size == dma_queue_ptr->capacity) //queue is full
//    {
//        return(hal_res_NOK_busy); 
//    }
//    
//    buff_num = dma_queue_ptr->capacity -1 - dma_queue_ptr->index;
//    
//    s_hal_can_copy_frame_inDMA(frame,buff_num);
//    
//    //s_hal_can_ena_dmabuff_withPrio(port, buff_num);
//    
//    dma_queue_ptr->size ++;
//    dma_queue_ptr->index = ((dma_queue_ptr->index + 1)%dma_queue_ptr->capacity);
//
//}


static void s_hal_can_ena_dmabuff_withPrio(hal_can_port_t port, uint8_t buf_index)
{
    uint8_t i_prio = buf_index;

    switch( buf_index)
    {
        case 0:
        {        
            C1TR01CONbits.TX0PRI = s_can_dmabuff_prio_tbl[i_prio];
            C1TR01CONbits.TXREQ0=1;
            return; 
        }
        case 1:
        {
            C1TR01CONbits.TX1PRI = s_can_dmabuff_prio_tbl[i_prio];
            C1TR01CONbits.TXREQ1=1;
            return; 
        }
        case 2:
        {
            C1TR23CONbits.TX2PRI = s_can_dmabuff_prio_tbl[i_prio];
            C1TR23CONbits.TXREQ2=1;
            return; 
        }
        case 3:
        {
            C1TR23CONbits.TX3PRI = s_can_dmabuff_prio_tbl[i_prio];
            C1TR23CONbits.TXREQ3=1;
            return; 
        }
    }
}




