robotology/icub-firmware/emBODY/arch-dspic33/body/abslayer/hal-package/hal/hal-src/hal_dspic_can.c
static void s_hal_can_clk_init(hal_can_port_t port, hal_can_baudrate_t br_val)
{
    //TODO copiato dall'esempio
    /* FCAN is selected to be FCY
       FCAN = FCY = 40MHz
     */
    C1CTRL1bits.CANCKS = 0x1; //probabilmente questo non serve perche' questo bit non e' implemenatto sul nostro micro.

    /*
    Bit Time = (Sync Segment + Propagation Delay + Phase Segment 1 + Phase Segment 2)=20*TQ
    Phase Segment 1 = 8TQ
    Phase Segment 2 = 6Tq
    Propagation Delay = 5Tq
    Sync Segment = 1TQ
    CiCFG1<BRP> =(FCAN /(2 ×N×FBAUD))– 1
    */

    /* Synchronization Jump Width set to 4 TQ */
    C1CFG1bits.SJW = 0x3;
    
    /* Baud Rate Prescaler */
    if(hal_can_baudrate_1mbps == br_val)
    {
        C1CFG1bits.BRP = HAL_CAN_BR_VAL_1Mbps;
    }
    else
    {
        C1CFG1bits.BRP = HAL_CAN_BR_VAL_500kbps;
    }   

    /* Phase Segment 1 time is 8 TQ */
    C1CFG2bits.SEG1PH=0x7;
    /* Phase Segment 2 time is set to be programmable */
    C1CFG2bits.SEG2PHTS = 0x1;
    /* Phase Segment 2 time is 6 TQ */
    C1CFG2bits.SEG2PH = 0x5;
    /* Propagation Segment time is 5 TQ */
    C1CFG2bits.PRSEG = 0x4;
    /* Bus line is sampled three times at the sample point */
    C1CFG2bits.SAM = 0x1;
}


//static uint8_t s_hal_can_dspic_check_queue_cfg(hal_can_dspic_queue_cfg_t *queue_cfg)
//{
//    uint8_t i;
//
//    for(i=0; i<hal_can_send_mode_num; i++)
//    {
//        if( (queue_cfg->rxqnorm_num == s_default_queue_cfg[i].rxqnorm_num) &&
//            (queue_cfg->txqnorm_num == s_default_queue_cfg[i].txqnorm_num) &&
//            (queue_cfg->txqhigh_num == s_default_queue_cfg[i].txqhigh_num) )
//        {
//            return(i);
//        }
//    }
//    return(HAL_CAN_DSPIC_DEF_QUEUE_CFG_INDEX_NULL);
//}



static void s_hal_can_dmaqueue_info_init(hal_can_port_t port)
{
    hal_can_portdatastructure_t *cport = s_hal_can_portdatastruct_ptr[HAL_can_port2index(port)];

    cport->canframes_tx_norm.capacity = s_dspic_default_queue_cfg[cport->cfg.runmode].txqnorm_num;
    cport->canframes_tx_norm.size = 0;
    cport->canframes_tx_norm.index_in = 0;
    cport->canframes_tx_norm.index_out = 0;

    cport->canframes_tx_high.capacity = s_dspic_default_queue_cfg[cport->cfg.runmode].txqhigh_num;
    cport->canframes_tx_high.size = 0;
    cport->canframes_tx_high.index_in = 0;
    cport->canframes_tx_norm.index_out = 0;

}



/* configure dma channels for tx and rx of can1 peripheral */
static void s_can_dma_channels_config(void)
{
    /* ---- configure DMA channel 0 for can tx ---- */

    /* disable Peripheral Write Collision detection */
    DMACS0bits.PWCOL0 = 0b0;  //TODO is it correct???
    /* disable DMA module Write Collision detection */
    DMACS0bits.XWCOL0 = 0b0;  //TODO is it correct???


    /* Data Transfer Size = word */
    DMA0CONbits.SIZE = 0x0;
    /* Transfer Direction = Read from DPSRAM address, write to peripheral address */
    DMA0CONbits.DIR = 0x1;
    /* DMA Channel Addressing Mode = Peripheral Indirect Addressing mode */
    DMA0CONbits.AMODE = 0x2;
    /* DMA Channel Operating Mode = Continuous, Ping-Pong modes disabled */
    DMA0CONbits.MODE = 0x0;
    /* Block Transfer Interrupt = Initiate interrupt when all of the data has been moved */
    DMA0CONbits.HALF = 0x0;


    /* configure address of ECAN Transmit Data Register(C1TXD) */
    DMA0PAD=0x0442;

    /* define data block size to transfer. It is equal to can message size (= 8 word).
       Note: the module sum 1 to this number. 
    */
    DMA0CNT=0x0007;

    /* associate the DMA channel with a specific DMA capable peripheral (TX Data Request)*/
    DMA0REQ=0x0046;

    /* set satrt address of DMA buffer */
    DMA0STA=  __builtin_dmaoffset(s_hal_can_dmabuffer);



    /* ---- configure DMA channel 1 for can rx ---- */

    /* disable Peripheral Write Collision detection */
    DMACS0bits.PWCOL1 = 0b0;  //TODO corretto???
    /* disable DMA module Write Collision detection */
    DMACS0bits.XWCOL1 = 0b0;

    /* Data Transfer Size = word */
    DMA1CONbits.SIZE = 0x0;
    /* Transfer Direction = Read from Peripheral address, write to DPSRAM address */
    DMA1CONbits.DIR = 0x0;
    /* DMA Channel Addressing Mode = Peripheral Indirect Addressing mode */
    DMA1CONbits.AMODE = 0x2;
    /* DMA Channel Operating Mode = Continuous, Ping-Pong modes disabled */
    DMA1CONbits.MODE = 0x0;
    /* Block Transfer Interrupt = Initiate interrupt when all of the data has been moved */
    DMA1CONbits.HALF = 0x0;


    /* configure address of ECAN Receive Data Register(C1RXD) */
    DMA1PAD = 0x0440;

    /* define data block size to transfer. It is equal to can message size (= 8 word).
     * Note: the module sum 1 to this number. */
    DMA1CNT = 0x0007;

    /* associate the DMA channel with a specific DMA capable peripheral (RX Data Ready)*/
    DMA1REQ = 0x0022;

    /* set start address of DMA buffer */
    DMA1STA =  __builtin_dmaoffset(s_hal_can_dmabuffer);
}


static void s_hal_can_dma_init(hal_can_port_t port)
{
    hal_can_portdatastructure_t *cport = s_hal_can_portdatastruct_ptr[HAL_can_port2index(port)];

    s_can_dma_channels_config();

    C1CTRL1bits.WIN = 0;
    
    
    /* RX FIFO Starts at end of tx buffers */
    C1FCTRLbits.FSA = cport->canframes_tx_norm.capacity + cport->canframes_tx_high.capacity;
    C1FCTRLbits.DMABS = 0x6; // = 0b110; //set RX fifo ends 

    switch(cport->cfg.runmode)
    {
        case hal_can_runmode_noisr_0q:
        {
            C1TR01CONbits.TXEN0 = 1;            // set buffer 0 as transmit buffer
            C1TR01CONbits.TXEN1 = 0;            // set buffer 1 as receive buffer
            C1TR23CONbits.TXEN2 = 0;            // set buffer 2 as receive buffer
            C1TR23CONbits.TXEN3 = 0;            // set buffer 3 as receive buffer
            C1TR45CONbits.TXEN4 = 0;            // set buffer 4 as receive buffer
            C1TR45CONbits.TXEN5 = 0;            // set buffer 5 as receive buffer
            C1TR67CONbits.TXEN6 = 0;            // set buffer 6 as receive buffer
            C1TR67CONbits.TXEN7 = 0;            // set buffer 7 as receive buffer

            C1TR01CONbits.TX0PRI = 0b11;         // set priority highest to transmit buffer 0
        } break;


        case hal_can_runmode_isr_1txq1rxq:
        {
            C1TR01CONbits.TXEN0 = 1;            // set buffer 0 as transmit buffer
            C1TR01CONbits.TXEN1 = 1;            // set buffer 1 as transmit buffer
            C1TR23CONbits.TXEN2 = 1;            // set buffer 2 as transmit buffer
            C1TR23CONbits.TXEN3 = 1;            // set buffer 3 as transmit buffer
            C1TR45CONbits.TXEN4 = 0;            // set buffer 4 as receive buffer
            C1TR45CONbits.TXEN5 = 0;            // set buffer 5 as receive buffer
            C1TR67CONbits.TXEN6 = 0;            // set buffer 6 as receive buffer
            C1TR67CONbits.TXEN7 = 0;            // set buffer 7 as receive buffer 
            
            /* Buffer priority will be set during execution, because circular mode is performed turning prio values */
        } break;


        case hal_can_runmode_isr_2txq1rxq:
        {
            C1TR01CONbits.TXEN0 = 1;            // set buffer 0 as transmit buffer
            C1TR01CONbits.TXEN1 = 1;            // set buffer 1 as transmit buffer
            C1TR23CONbits.TXEN2 = 1;            // set buffer 2 as transmit buffer
            C1TR23CONbits.TXEN3 = 1;            // set buffer 3 as transmit buffer
            C1TR45CONbits.TXEN4 = 1;            // set buffer 4 as transmit buffer
            C1TR45CONbits.TXEN5 = 1;            // set buffer 5 as transmit buffer
            C1TR67CONbits.TXEN6 = 1;            // set buffer 6 as transmit buffer
            C1TR67CONbits.TXEN7 = 0;            // set buffer 7 as receive buffer
            
