robotology/icub-firmware/emBODY/arch-dspic33/body/abslayer/hal-package/hal/hal-src/hal_dspic_can.c
            /* HighPrio queue is used like circular buffer. it can be done by turning prio values, 
               like hal_can_runmode_isr_1txq1rxq, but only on 3 buffer and three hightest priority values*/

            /* Set lowest priority to LowPrio queue */
            C1TR23CONbits.TX3PRI=0;         // set priority highest to transmit buffer 3
            C1TR45CONbits.TX4PRI=0;         // set priority highest to transmit buffer 4
            C1TR45CONbits.TX5PRI=0;         // set priority highest to transmit buffer 5
            C1TR45CONbits.TX5PRI=0;         // set priority highest to transmit buffer 6
        } break;

    }


    //clean all flags for full and overflow buffer
    C1RXFUL1 = 0x0000;
    C1RXFUL2 = 0x0000;
    C1RXOVF1 = 0x0000;
    C1RXOVF2 = 0x0000;
}

static void s_hal_can_copy_frame_inDMA(hal_can_frame_t *frame, uint8_t dmaBuff_index)
{
    hal_can_dspic_DMAframe_t *DMAframe;

    DMAframe = &s_hal_can_dmabuffer[dmaBuff_index];

    memset(DMAframe, 0, sizeof(hal_can_dspic_DMAframe_t));
    //NOTE: DMAframe.IDE = 0 indicates frame with standard ID

    DMAframe->SID =(uint16_t)frame->id;

    DMAframe->DLC = frame->size;

    memcpy(&DMAframe->data, &frame->data, DMAframe->DLC);
}



static hal_result_t s_hal_can_rxFilter_set_mask( uint8_t mask_num, uint32_t mask_val, hal_can_frameID_format_t idformat)
{
    uint32_t sid = 0,eid15_0=0, eid17_16=0;
    uint16_t *maskRegAddr, *maskExtRegAddr; 

    // unlock mask changes
    C1CTRL1bits.WIN=1;
    
    // Obtain the Address of CiRXMmSID register for given Mask number "m"
    maskRegAddr = (uint16_t *)(&C1RXM0SID + (mask_num << 1));
    maskExtRegAddr = maskRegAddr + 1;

    // Bit-filed manupulation to write to Filter Mask register
    if(hal_can_frameID_ext == idformat) 
    {     
        // Filter Extended Identifier
        eid15_0 = (mask_val & 0xFFFF);
        eid17_16= (mask_val>>16) & 0x3;
        sid = (mask_val>>18) & 0x7FF;
        
        // 0x008 for set mide bit: so filter maches only eid or only sid.
        *maskRegAddr=((sid)<<5) + 0x0008 + eid17_16;  // Write to CiRXMnSID Register
        *maskExtRegAddr= eid15_0;  // Write to CiRXMnEID Register
    }
    else
    {
        // Filter Standard Identifier
        sid = (mask_val & 0x7FF);
        
        // 0x008 for set mide bit: so filter maches only eid or only sid.
        *maskRegAddr = ((sid)<<5) + 0x0008;  // Write to CiRXMnSID Register    
        *maskExtRegAddr = 0;  // Write to CiRXMnEID Register
    }

    // lock mask changes
    C1CTRL1bits.WIN=0;

    return(hal_res_OK);    
}



static hal_result_t s_hal_can_rxFilter_set_id(uint8_t id_num, int32_t id_val, hal_can_frameID_format_t idformat, uint8_t mask_sel) 
{
  
    uint32_t sid = 0, eid15_0 = 0, eid17_16 = 0;
    uint16_t *sidRegAddr, *exidRegAddr, *bufPntRegAddr, *maskSelRegAddr, *fltEnRegAddr;
    uint16_t aux;
        
    // unlock filter changes
    C1CTRL1bits.WIN=1;
    
    // Obtain the Address of CiRXFnSID, CiBUFPNTn, CiFMSKSELn and CiFEN register for a given filter number "n"
    sidRegAddr = (uint16_t *)(&C1RXF0SID + (id_num << 1)); // I need moltiply for 2 (<< 1), beause after C1RXF0SID there is C1RXF0EID register. regiters memory map
    exidRegAddr = sidRegAddr + 1; // C1RXF0EID is next to C1RXF0SID. see regiters memory map.

    fltEnRegAddr = (uint16_t *)(&C1FEN1);

    // Bit-field manupulation to write to Filter identifier register
    if(hal_can_frameID_ext == idformat) 
    {
        // Filter Extended Identifier
        eid15_0 = (id_val & 0xFFFF);
        eid17_16= (id_val>>16) & 0x3;
        sid = (id_val>>18) & 0x7FF;
        
        // 0x8 ==> set EXIDE bit so , the filter maches only EID.
        *sidRegAddr =(((sid)<<5) + 0x8) + eid17_16;  // Write to CiRXFnSID Register
        *exidRegAddr = eid15_0;  // Write to CiRXFnEID Register
    }
    else
    {  
        // Filter Standard Identifier
        sid = (id_val & 0x7FF);            
        *sidRegAddr=(sid)<<5;  // Write to CiRXFnSID Register in bit from 5 to 15
        *exidRegAddr = 0;  // Write to CiRXFnEID Register
    }

    //select the correct buffer and mask register
    if( (id_num <=3) )
    {
        bufPntRegAddr = (uint16_t *)(&C1BUFPNT1);
        maskSelRegAddr = (uint16_t *)(&C1FMSKSEL1);
    }
    else if( (id_num >= 4) && (id_num <=7) ) 
    {
        bufPntRegAddr = (uint16_t *)(&C1BUFPNT2);
        maskSelRegAddr = (uint16_t *)(&C1FMSKSEL1);
    }
    else if( (id_num >= 8) && (id_num <=11) ) 
    {
        bufPntRegAddr = (uint16_t *)(&C1BUFPNT3);
        maskSelRegAddr = (uint16_t *)(&C1FMSKSEL2);
    }
    else if( (id_num >= 12) && (id_num <=15) ) 
    {
        bufPntRegAddr = (uint16_t *)(&C1BUFPNT4);
        maskSelRegAddr = (uint16_t *)(&C1FMSKSEL2);
    }
     
    //set the buffer where can messages will be inserted if they mach filter
    // I do filter_num%4 because in each register 4 buffer pointer.
    // I moltiply for 4, because buffer pointer is codifies in 4 bits.
    aux = 0xFFFF - (0xF <<(4* (id_num%4) ));          
    *bufPntRegAddr &= aux; //clear bits
    *bufPntRegAddr |= 0xF << (4*(id_num%4));  // set 0xF buffer, that is FIFO queue.

    if(mask_sel < 3 )
    {    
        aux = 0xFFFF - ( 0x3 <<(2*(id_num%8)) );
        *maskSelRegAddr &= aux; //clear bits
        *maskSelRegAddr |=(  mask_sel <<(2*(id_num%8)) );
    }

    *fltEnRegAddr |= (0x1 << id_num);  // Write to C1FEN1 Register
    
    // lock filter changes
    C1CTRL1bits.WIN=0;

    return(hal_res_OK);
}


//#define HAL_CAN_INT_TX_ENA(p)                   C1INTEbits.TBIE = 1;
//#define HAL_CAN_INT_TX_DISA(p)                  C1INTEbits.TBIE = 0;

static void s_hal_canperipheral_isr_tx_enable(hal_can_port_t port)
{   // i enable the global can isr to happen for tx buffer empty
    C1INTEbits.TBIE = 1;    // TX Buffer Interrupt Enable bit
}

static void s_hal_canperipheral_isr_tx_disable(hal_can_port_t port)
{   // i disable the global can isr to happen for tx buffer empty   
    C1INTEbits.TBIE = 0;    // TX Buffer Interrupt Enable bit
}
    

static void s_hal_can_dma_rx_enable(hal_can_port_t port)
{
    DMA1CONbits.CHEN = 1; //enable DMA buffer rx;
}

static void s_hal_can_dma_rx_disable(hal_can_port_t port)
{
    DMA1CONbits.CHEN = 0; //disable DMA buffer rx;
}


static uint8_t s_hal_can_dma_rx_size(hal_can_port_t port)
{
    volatile uint32_t bits;
    uint32_t i = 0;
    uint8_t size = 0;
    uint32_t msk;
    bits = (uint32_t)C1RXFUL1;
    bits |=  (((uint32_t)C1RXFUL2) << 16);
    bits &= s_can_rxdmamask;
    
    for(i=0; i<32; i++)
    {
        msk = 0x00000001L<<i;
        if((bits & msk) == msk)
        {
            size++;
        }
    }
    
    return(size);
   
}

#endif//HAL_USE_CAN

// --------------------------------------------------------------------------------------------------------------------
// - end-of-file (leave a blank line after)
// --------------------------------------------------------------------------------------------------------------------



